src/integ-test/bdd-test/features/flows/TestFlusso_mod3CancelV2_closePaymentV2_ko_noSPR_multipleTokens

Feature:  flow checks for sendPaymentResult-v2 request - mod3CancelV2, closePayment-v2 KO, no sendPaymentResult-v2, multipleTokens [FLUSSO_SPR_08]
 
  Background:
    Given systems up 
    And EC new version
    
    # checkPosition phase
    Scenario: Execute checkPosition request
    Given initial json checkPosition
    
    """
    {"positionslist": [
    {"fiscalCode": "#creditor_institution_code#", 
    "noticeNumber": "#notice_number#"}
    ]
    }
    """
    
    When PM sends checkPosition to nodo-dei-pagamenti
    Then check outcome is OK of checkPosition response
    And check errorCode is 200 of checkPosition response
    
   # activatePaymentNoticeV2 phase
    Scenario: Execute activatePaymentNoticeV2 request
    Given stazione with STAZIONI.VERSIONE_PRIMITIVE = 2
    And initial XML activatePaymentNoticeV2 soap-request
	
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:activatePaymentNoticeV2Request>
             <idPSP>70000000001</idPSP>
             <idBrokerPSP>70000000001</idBrokerPSP>
             <idChannel>70000000001_01</idChannel>
             <password>pwdpwdpwd</password>
             <idempotencyKey>#idempotency_key#</idempotencyKey>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number#</noticeNumber>
             </qrCode>
             <!--expirationTime>3000</expirationTime-->
             <amount>10.00</amount>
             <paymentNote>responseFull</paymentNote>
          </nod:activatePaymentNoticeV2Request>
       </soapenv:Body>
    </soapenv:Envelope>
    """
        
    When psp sends SOAP activatePaymentNoticeV2 to nodo-dei-pagamenti
    Then check outcome is OK of activatePaymentNoticeV2 response
    
    # activatePaymentNoticeV2 phase 1
    Scenario: Execute activatePaymentNoticeV2 request
    Given initial XML activatePaymentNoticeV2 soap-request
	
    """
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
       <soapenv:Header/>
       <soapenv:Body>
          <nod:activatePaymentNoticeV2Request>
             <idPSP>70000000001</idPSP>
             <idBrokerPSP>70000000001</idBrokerPSP>
             <idChannel>70000000001_01</idChannel>
             <password>pwdpwdpwd</password>
             <idempotencyKey>#idempotency_key_1#</idempotencyKey>
             <qrCode>
                <fiscalCode>#creditor_institution_code#</fiscalCode>
                <noticeNumber>#notice_number_1#</noticeNumber>
             </qrCode>
             <!--expirationTime>3000</expirationTime-->
             <amount>10.00</amount>
             <paymentNote>responseFull</paymentNote>
          </nod:activatePaymentNoticeV2Request>
       </soapenv:Body>
    </soapenv:Envelope>
    """
        
    When psp sends SOAP activatePaymentNoticeV2 to nodo-dei-pagamenti
    Then check outcome is OK of activatePaymentNoticeV2 response
    
    # mod3CancelV2 phase
    Scenario: Execute mod3CancelV2 poller
    Given the Execute activatePaymentNoticeV2 request scenario executed successfully
    When job mod3CancelV2 triggered after 4 seconds
    Then verify the HTTP status code of mod3CancelV2 response is 200
     
    # closePayment-v2 phase  
    Scenario: Execute a closePayment-v2 request
    Given idChannel with CANALI_NODO.VERSIONE_PRIMITIVE = 2
    And initial json closePayment-v2
    """   
    {"paymentTokens": [
        "$activatePaymentNoticeV2Response.paymentToken",
        "$activatePaymentNoticeV2-1Response.paymentToken"
        ],
    "outcome": "KO",
    "idPSP": "70000000001",
    "idBrokerPSP": "70000000001",
    "idChannel": "70000000001_08",
    "paymentMethod": "TPAY",
    "transactionId": "19392562",
    "totalAmount": 22.00,
    "fee": 2.00,
    "timestampOperation": "2033-04-23T18:25:43Z",
    "additionalPaymentInformations": {
          "key": "10793459"
        }
    }
    """

    When PM sends closePayment-v2 to nodo-dei-pagamenti
    Then check esito is KO of closePayment-v2
    And check errorCode is 400 of closePayment-v2
    And check description is 'Unacceptable outcome when token has expired'
    And check no sendPaymentResult-v2 is sent to PM
    
       
    
    # DB CHECK
    # SELECT s.* FROM POSITION_PAYMENT_STATUS s WHERE s.NOTICE_ID ='#notice_number#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#' order by s.ID ASC;
    # SELECT s.* FROM POSITION_PAYMENT_STATUS_SNAPSHOT s WHERE s.NOTICE_ID ='#notice_number#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#';
    # SELECT s.* FROM POSITION_STATUS s WHERE s.NOTICE_ID ='#notice_number#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#' order by s.ID ASC;
    # SELECT s.* FROM POSITION_STATUS_SNAPSHOT s WHERE s.NOTICE_ID ='#notice_number#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#';
    
    # POSITION_PAYMENT_STATUS
    # status == 'PAYING'
    # status1 == 'CANCELLED'
    # status11 == null
    
    # POSITION_PAYMENT_STATUS_SNAPSHOT
    # status == 'CANCELLED'
    # status1 == null
    
    # POSITION_STATUS
    # status == 'PAYING'
    # status1 == 'INSERTED'
    # status2 == null
    
    # POSITION_STATUS_SNAPSHOT
    # status == 'INSERTED'
    # status1 == null
    
    # SELECT s.* FROM POSITION_PAYMENT_STATUS s WHERE s.NOTICE_ID ='#notice_number_1#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#' order by s.ID ASC;
    # SELECT s.* FROM POSITION_PAYMENT_STATUS_SNAPSHOT s WHERE s.NOTICE_ID ='#notice_number_1#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#';
    # SELECT s.* FROM POSITION_STATUS s WHERE s.NOTICE_ID ='#notice_number_1#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#' order by s.ID ASC;
    # SELECT s.* FROM POSITION_STATUS_SNAPSHOT s WHERE s.NOTICE_ID ='#notice_number_1#' AND s.PA_FISCAL_CODE = '#creditor_institution_code#';
    
    # POSITION_PAYMENT_STATUS
    # status == 'PAYING'
    # status1 == 'CANCELLED'
    # status11 == null
    
    # POSITION_PAYMENT_STATUS_SNAPSHOT
    # status == 'CANCELLED'
    # status1 == null
    
    # POSITION_STATUS
    # status == 'PAYING'
    # status1 == 'INSERTED'
    # status2 == null
    
    # POSITION_STATUS_SNAPSHOT
    # status == 'INSERTED'
    # status1 == null